Revit 2027 API
FileDialog Properties
The FileDialog type exposes the following members.
Properties
Name | Description
DefaultFilterEntry |  The default entry (from the filter) to be selected in the dialog.
Filter |  The filter string representing a collection of extensions allowed by the dialog.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Title |  The title to show on the dialog.
Top
See Also
Reference
FileDialog Class
Autodesk.Revit.UI Namespace